#include<stdio.h>
int main()
{
	//1 成立     //0 不成立


	//&& :与,而且  两边都为真,结果才是真.只要有一个不成立,那结果都不成立
	//同时满足
	printf("%d\n", 1 && 1); //1
	printf("%d\n", 0 && 0); //0
	printf("%d\n", 1 && 0); //0
	printf("%d\n", 0 && 1); //0
	printf("---------------------\n");



	//|| :或,或者  两边都为假,结果才是假.与&&相反.两边都不成立,才可以
	//二选一
	printf("%d\n", 1 || 1); //1
	printf("%d\n", 0 || 0); //0
	printf("%d\n", 1 || 0); //1
	printf("%d\n", 0 || 1); //1
	printf("---------------------\n");

	//!  :非,取反  取反
	//细节:实际开发当中最多只用一个
	printf("%d\n", !1);  //0
	printf("%d\n", !0);  //1

	int x;
	x <= 0;

	int d;
	d != 0;
	





	return 0;
}