#include<stdio.h>
int main()
{

	//三元运算符,三元表达式,问号冒号运算符

	// [正确格式] 条件 ? 值1 : 值2  —— 条件为真取"值1", 为假取"值2"
	// [易错] 原来注释写成"关系表达式 :?" 是笔误, 中间是问号不是冒号

	//练习1.获取两个变量之间的较大值
	/*int a = 10;
	int b = 20;
	int c = a > b ? a : b;
	printf("%d\n",c);
	printf("%d\n", a > b ? a : b);*/


	//练习2.获取三个变量中的最大值
	int a = 10;
	int b = 20;
	int c = 30;


	//先任意挑选两个数,然后进行比较,选出较大值
	// [核心] 先挑两个比, 得较大值
	int temp= a > b ? a : b;

	//再用较大值,与第三个数进行比较,选出最大值
	// [核心] 再拿较大值跟第三个数比, 得最大值
	// [优化] 求 N 个数最大值更通用的做法是"打擂台": 先设 max=第一个, 再逐个 if(max<x) max=x
	int max=  c > temp ? c : temp;

	//输出打印
	printf("%d\n", max);

	return 0;
}







