#include<stdio.h>
int main()
{
	int a = 1, b = 2, c = 3;
	printf("%d %d %d\n", a,b,c);


	//逗号运算符(分隔符)
    //规则:
	//1.从左到右
	//最后一个子表达式的结果,是整个表达式的结果
	//逗号运算符优先级最低,永远是最后执行
	
	
	//古法
	/*int i = 3;
	i++;
	++i;
	printf("%d\n",i+5);*/

	//简单方法
	int i;
	i = 3, ++i, i++, i + 5;
	printf("%d\n",i+5);
	printf("%d\n",(i= 3, ++i, i++, i + 5));
	//此时需要打括号,不然会只记录i=3,而省略后面的运算
	


	//练习
	//任意给出一个数字,三人拿到之后进行不同的操作
	//是拿前一个数字,进行操作
	//1,变为绝对值
	//2.除以3,获取余数
	//3.乘以10
	//最后数字是多少?

	//以前的知识

	////1.定义变量
	//int num = -91;
	//num = num > 0 ? num : -num;
	//printf("%d\n",num);

	////2.除以3,获取余数
	///*num = num % 3;*/
	//num %= 3;
	//printf("%d\n", num);

	////3.乘以10
	///*num = num * 3;*/
	//num *= 3;
	//printf("%d\n", num);

	//逗号运算符
	//1.定义变量
	int num = 17;
	printf("%d\n", (num = num > 0 ? num : -num, num %= 3, num *= 10));

	//上面的*=3,是打错了
	//逗号运算符,在考试时运用时比较多


	return 0;
}





