#include<stdio.h>
 int main ()
{
     /*int a = 10, b = 20, c = 30;
     printf("%d\n",a + b * c );*/

     //开发当中记住小括号优先级最高即可
     //考试中一元>二元>三元
     //&&>||>赋值
     //一个变量就可以使用的运算符,叫做一元运算符
     //+ - 叫做正号,负号
     //小括号  一元  二元  &&  ||  三元  赋值  逗号

     //三元运算符的解题关键
     //从左边第一个问好开始找冒号
     //如果过程中,遇到其他问号,那么找冒号的数量加一

     //a > b ? a : b;
     //a > b ? (a) : (b);



     ////练习1.
     //int w = 4, x = 3, y = 2, z = 1;

     ////int num = w < x ? w : z < y ? z : x;
     //int num = w < x ? (w) : (z < y ? z : x);  //1

     ////先比大小,后使用表达式
     //printf("%d\n",num);


     //练习2.
     /*int a = 1, b = 2, c = 3;
     int max = a > b ? (a > c ? a : c) : (b > c ? b : c);*/

     /*printf("max=%d\n", max);*/

     //练习3.
     int x = 10;
     int y = 20;
     int z = 30;
     int h = 40;
     int w = 50;
    
     int number = x > h ? (z > w ? (x > z ? (x > y ? x : y) : z) : w) : (w > h ? w : h);

     printf("%d\n", number);

     //套路:猜出题者的心,即如果上边的代码都是大于号,那么可以尝试寻找最大值
     //反之,亦然

     //注意 +:可能是正号,也有可能是加法
     //大于等于优先级高于等等和不等


     //从优先级最低的找起,把一整个分段
     //先找赋值,再||,最后&&


     int a = 3, b = 4, c = 5;
    
     printf("%d\n", a && b);
     printf("%d\n", a <= 5);

     a || b + c && b - c;
     printf("%d\n", a || b + c && b - c);

     //可用短路思维快速判断
     //注意优先级


     !((a < b) && !c || 1);
     printf("%d\n", !((a < b) && !c || 1));






  return 0;
}



