#include<stdio.h>
int main()
{

	//一.顺序结构
	//1.程序默认执行流程
	//2.从上往下依次进行的


	//二.分支结构
	//1.程序默认执行过程中出现了岔路     (if用于判断,switch用于选择)
	//2.从上往下依次进行的


	// if:满足条件,才可以执行指定的代码
	// 使用场景:某些代码,在满足条件时才执行


	//if的格式:
	//	if (关系表达式)
	//	{
	//
	//		语句体
	//
	//
	//	}

	//需求:判断变量a里面记录的值,是否大于10;若成立,就打印语句:真的大于10
	//定义变量
	int a = 22;
	if (a > 10)
	{   
		printf("真的大于10\n");
	}

	double tem = 37.8;
	if (tem > 37.5)
	{
		printf("你的体温是:%.3f度\n",tem);
		printf("体温过高,发出警告\n");

	}


	//游戏人物血条
	//需求:初始最大生命是200,受到伤害80,技能回复100
	//问:当前血量是多少?

	//一.定义变量,记录数据
	int blood   = 200;  //初始最大生命
	int damage  = 200;   //受到伤害
	int restore = 100;  //技能回复

	//二.游戏的逻辑
	blood = blood - damage + restore;
	printf("blood=%d\n",blood);
	if (blood>200)
	{
		printf("由于血量存在上限\n");
		blood = 200;
		printf("blood=%d\n", blood);
		printf("由于血量上限为200,所以此时血量为200\n");
		printf("血量上限为%d,所以此时血量为%d\n", 200, blood);
		//最后一个为更高级的写法

	}


	//细节1.c语言当中,如果判断结果是一个数字,非零表示条件成立,零则表示条件不成立
	if (1)
	{
		printf("执行了");
	}


	return 0;
}
