#include<stdio.h>
int main()
{
	//循环结构:重复执行某件事
	//开始条件,结束条件,控制开关
	//初始化语句,条件判断语句,条件控制语句
	//例如:1,100,每次+1   (喊100遍)
	//改为+2,其余不变    就是50遍
	//重复喊的话是循环体语句,即重复实行的代码
	// for , while , do...while

	//for的结构:

	/*for (初始化语句; 条件判断语句; 条件控制语句)
	{
		循环体语句
	}*/

	//注意:是两个分号



	// [核心] for(初始化; 条件; 控制) 三段用两个分号隔开
	//        执行顺序: 初始化(1次) -> 判断 -> 循环体 -> 控制 -> 再判断 ...
	for (int i=1; i<= 3; i++)
	{
		printf("我是卡密\n");
	}



	printf("对朋友说的话:\n");

	for (int i = 1; i <= 10; i++)
	{
		// [补充] i 是"循环变量", 每次循环 +1, 用来数到第几遍了
		printf("第%d遍:我们结为兄弟如何\n",i);
	}

	for (int i = 1; i <= 10; i++)
	{
		printf("%d\n", i);
	}







	return 0;
}