#define _CRT_SECURE_NO_WARNINGS

#include<stdio.h>
int main()
{

	/*初始化语句
		while (条件判断语句)
		{
			循环体语句
			条件控制语句
		}*/


    //需求:
	//打印三遍名字

	int d = 1;
	while (d <= 3)
	{
		printf("一袋米要扛几楼\n");
		d++;
	}

	//for和while相同点:  运行规则一样

	//不同点:归属for循环,for循环结束后,不能再被访问
	//不归属while循环,while循环结束后,可以再被访问
	//担当for循环中的int语句写在外面,就能没有这种区别


	//真正的区别:
	//for:知道循环次数与范围
	//while:不知道循环次数与范围,但知道循环的结束条件

	//即格式与使用习惯造成的

	//举例1:累加求和1~100:使用for
	//举例2:读取文件中的内容:用while
	//一次只能读取一个汉字或字母


	

	//二的任意次方%2的结果都是1


	//得到1就输出yes
	//没得到就输出no


	//循环结束的条件
	//1.结果是1时就,可以了,yes
	//2.结果无法被2整除,也可以结束,no


	//1.定义一个变量记录数字

	int c = 100;

	//2.利用循环不断除以2

	//小括号里面写:什么情况下,循环可以继续进行,跟上面的推断,是反过来的

	while (c > 1 && c % 2 == 0)
	{
		c = c / 2;
		printf("%d\n", c);
	}

	//3.判断
	if (c == 1)
	{
		printf("yes\n");
	}
	else
	{
		printf("no\n");
	}

	/*需求:世界上最高的山峰是珠穆朗玛峰8844.43米等于8844430mm
	       假如我有一张足够大的纸，它的厚度是0.1mm，
		   请问我折叠多少次可以折成珠穆朗玛峰的高度？*/

	//循环结束: 纸张厚度 > 珠穆朗玛峰的高度

	//1.定义变量记录厚度与高度

	int a = 8844430;
	double b = 0.1;
	int count = 0;

	//2.利用循环折叠纸
	//小括号:是在此情况下,循环可以继续进行,跟上面的结束条件是反过来的
	while (b <= a)
	{
		b = b * 2;
		count++;
	}

	printf("最终厚度为%.2lfmm\n",b);

	printf("一共折叠了%d次\n", count);



	/*需求:
	将一个整数 X 进行反转举例
	123  转化成  321。
    */

	int e = 312;

	int ea = e % 10;
	int eb = e / 10 % 10;
	int ec = e / 10 / 10 % 10;

	printf("%d\n", ea);
	printf("%d\n", eb);
	printf("%d\n", ec);

	int g = ea * 100 + eb * 10 + ec;
	printf("%d\n", g);


	

	//1.定义两个变量
	int num =704;
	int rev =0;

	//2.从右边开始,一次读取num中每个数,再拼到rev
	//第一次:num%10=3
	//0*10+3=3;

	//第二次:num/10 = 12%10 = 2;
    // 3*10+2=32;

	//第三次:1/10=1;
	//32*10+1;

	//3.循环结束条件: num==0;

	while (num != 0)
	{
		//获取num右边第一个数;
		int temp = num % 10;
		//去掉刚刚获取的数;
		num = num / 10;
		//把刚刚获取的数,拼接到rev当中
		rev = rev * 10 + temp;
	}

	//4.打印
	printf("%d\n",rev);



	/*
	   需求给你一个非负整数 X，计算并返回 X 的算术平方根。
	   结果只能保留整数部分，小数部分被舍去。
	   举例:
	   X 等于4，结果2
	   X 等于8, 结果2
   */

	/*  
	  规则:
		任意的数而言，如何确定平方根的整数部分？
		从一开始一个个找，直到第一个相乘的结果大于原来的数。
		那么前一个数,就是它平方根的整数部分
     */
	//1.定义一个数
	int num1 = -9;

	//定义后去找整数部分
	int i = 1;
	//2.利用循环去找平方根的整数部分
	if (num1 >= 0)
	{
		while (i * i <= num1)
		{
			i++;
		}
		//3.打印
		printf("%d\n", i - 1);
	}

	else
	{
		printf("负数没有平方根\n");
	}
	


	//1.定义两个变量
	int num2 =12321;
	int ori  =num2;
	int rev1 = 0;
	

	//2.从右边开始,一次读取num中每个数,再拼到rev
	//第一次:num%10=3
	//0*10+3=3;

	//第二次:num/10 = 12%10 = 2;
	// 3*10+2=32;

	//第三次:1/10=1;
	//32*10+1;

	//3.循环结束条件: num==0;

	while (num2 != 0)
	{
		//获取num右边第一个数;
		int temp1 = num2 % 10;
		//去掉刚刚获取的数;
		num2 = num2 / 10;
		//把刚刚获取的数,拼接到rev当中
		rev1 = rev1 * 10 + temp1;
	}

	

	if (rev1 == ori)
	{
		printf("这个数字是回文数\n");
	}
	else
	{
		printf("这个数字不是回文数\n");
	}

	printf("%d\n", rev1);
	printf("%d\n", ori);

	/*
	有两个整数，被除数 DIV 和除数 DIVISOR，
	将两数相除，要求不使用乘法、除法和取余运算.
	返回被除数 div 除以除数 divisor 得到的商和余数。
	比如:
	两个整数11和3
	输出结果:
	商是3，余是2。
	*/

	//商:执行减法的次数
	//余:剩下的数字

	int a1 = 11;
	int a2 = 3;
	int count1=0;

	while (a1 - a2 >= 0)
	{
		a1 = a1 - a2;
		count1++;
	}

	printf("该算式的商为:%d\n" "该算式的余为:%d\n",count1,a1);



	/*do...while 循环语法格式:

    初始化语句:
	do {
	
		循环语句体;
	
		条件控制语句;
	
	} while (条件判断语句);*/

	//先执行后判断
	//循环体至少执行一次

	int h = 1;

	do {

		printf("%d  ",h);

		h++;

	} while (h<=5);

	//就算把i的值赋值为10,也会运行一次
	//for的话,如有相同情况,则不会运行一次





	return 0;
}