#define _CRT_SECURE_NO_WARNINGS

#include<stdio.h>
int main()
{

	/*初始化语句
		while (条件判断语句)
		{
			循环体语句
			条件控制语句
		}*/


    //需求:
	//打印三遍名字

	int d = 1;
	while (d <= 3)
	{
		printf("一袋米要扛几楼\n");
		d++;
	}

	//for和while相同点:  运行规则一样

	//不同点:归属for循环,for循环结束后,不能再被访问
	//不归属while循环,while循环结束后,可以再被访问
	//担当for循环中的int语句写在外面,就能没有这种区别


	//真正的区别:
	//for:知道循环次数与范围
	//while:不知道循环次数与范围,但知道循环的结束条件

	//即格式与使用习惯造成的

	//举例1:累加求和1~100:使用for
	//举例2:读取文件中的内容:用while
	//一次只能读取一个汉字或字母


	

	//二的任意次方%2的结果都是1


	//得到1就输出yes
	//没得到就输出no


	//循环结束的条件
	//1.结果是1时就,可以了,yes
	//2.结果无法被2整除,也可以结束,no


	//1.定义一个变量记录数字

	int c = 100;

	//2.利用循环不断除以2

	//小括号里面写:什么情况下,循环可以继续进行,跟上面的推断,是反过来的

	while (c > 1 && c % 2 == 0)
	{
		c = c / 2;
		printf("%d\n", c);
	}

	//3.判断
	if (c == 1)
	{
		printf("yes\n");
	}
	else
	{
		printf("no\n");
	}

	/*需求:世界上最高的山峰是珠穆朗玛峰8844.43米等于8844430mm
	       假如我有一张足够大的纸，它的厚度是0.1mm，
		   请问我折叠多少次可以折成珠穆朗玛峰的高度？*/

	//循环结束: 纸张厚度 > 珠穆朗玛峰的高度

	//1.定义变量记录厚度与高度

	int a = 8844430;
	double b = 0.1;
	int count = 0;

	//2.利用循环折叠纸
	//小括号:是在此情况下,循环可以继续进行,跟上面的结束条件是反过来的
	while (b <= a)
	{
		b = b * 2;
		count++;
	}

	printf("最终厚度为%.2lfmm\n",b);

	printf("一共折叠了%d次\n", count);



	/*需求:
	将一个整数 X 进行反转举例
	123  转化成  321。
    */

	int e = 312;

	int ea = e % 10;
	int eb = e / 10 % 10;
	int ec = e / 10 / 10 % 10;

	printf("%d\n", ea);
	printf("%d\n", eb);
	printf("%d\n", ec);

	int g = ea * 100 + eb * 10 + ec;
	printf("%d\n", g);






	return 0;
}