#include<stdio.h>
int main()
{
	//插值查找:

	/*
	mid = min + (key - arr[min]) / (arr[max] - arr[min]) * (max - min)

	//其中min为偏移

		mid = 0 + (3 - 1) / (10 - 1) * (9 - 0)

		（分子 3 - 1 和 分母 10 - 1 被红框圈出）
	*/

	
		int a = 10;
		int b = 20;

		printf("&a = %p\n", &a);
		printf("&b = %p\n", &b);

	
		/*
		
		左侧：总结

			1. 顺序查找的特点
			对于数据没有任何要求，从头到尾遍历数组即可

			2. 二分查找、插值查找各自的特点
			相同点：
			都是通过不断的缩小范围来查找对应的数据的
			不同点：
			计算 mid 的方式不一样
			二分查找：mid 每次都是指向范围的中间位置
			插值查找：mid 尽可能的靠近要查找的数据，但是要求数据尽可能的分布均匀

		*/





//要求数据要有序，且数据分布尽可能均匀
//优势满足要求，效率比二分查找快，否则会更慢。












	return 0;
}









