#include<stdio.h>

int orderSorted(int arr[], int len, int num)    // 有序版
{
	for (int i = 0; i < len; i++)
	{
		if (arr[i] == num) return i;
		if (arr[i] > num)  break;      // 提前退出
	}
	return -1;
}

int order(int arr[], int len, int num)          // 无序版
{
	for (int i = 0; i < len; i++)
	{
		if (arr[i] == num) return i;
	}
	return -1;
}



int main()
{
	/*
	基本查找: 数据没有任何顺序
	二分查找，插值查找:数据一定要有顺序。
	*/

	//分块查找           

	/*
	分块的原则 1：前一块中的最大数据，小于后一块中所有的数据（块内无序，块间有序）

	分块的原则 2：块数数量一般等于数字的个数开根号。比如：16 个数字一般分为 4 块左右。

	核心思路：先确定要查找的元素在哪一块，然后在块内挨个查找。
	*/

	//看那个数组：整体是乱的（13, 19, 16, 20 不是递增的），但块与块之间有顺序：



	int a = 10;

	int* p = &a;              // p 装住了 a 的地址

	printf("a 的值   = %d\n", a);
	printf("&a 的地址 = %p\n", &a);
	printf("p  里装的 = %p\n", p);  // p 里装的应该等于 &a

	printf("a  = %d\n", a);
	*p = 99;                        // ★ 通过 p 改 a 的值
	printf("改完之后 a = %d\n", a);   // ★ 看 a 变成什么了
	
	//块
	int max;          //块中的最大值
	int startIndex;   //起始索引
	int endIndex;     //结束索引

	    /*
		+------ + -------- - +---------- +
		| min | max| 索引范围 |
		+------ + -------- - +---------- +
		| 22  | 40 | 0~4     |
		|  13 | 20 | 5~8     |
		|   7 | 10 | 9~10    |
		|  43 | 50 | 11~13   |
		+------ + -------- - +---------- +
		*/




	int arr[] = { 1,4,5,2,3 };
	int len = sizeof(arr) / sizeof(int);


	for (int i = 0; i < len - 1; i++)          // 外层:总共走 len-1 遍
	{
		for (int j = 0; j < len - 1 - i; j++)  // 内层:每遍少比一格
		{
			if (arr[j] > arr[j + 1])
			{
				int temp = arr[j];
				arr[j] = arr[j + 1];
				arr[j + 1] = temp;
			}
		}
	}


	//内循环:找到本次循环的较大值,再把较大值放在最右边
	//外循环:把上面的动作重复执行4次



	for (int i = 0;i < len;i++)
	{
		printf("%d  ",arr[i]);
	}

	

	////整体递增时：
	//	//c// 一旦发现比目标大了,后面不用看了,直接退出
	//	for (int i = 0; i < len; i++)
	//	{
	//		if (arr[i] == num) return i;
	//		if (arr[i] > num)  break;      // 提前退出
	//	}
	//return -1;

	////整体无序时：
	//	//c// 只能老老实实走到最后
	//	for (int i = 0; i < len; i++)
	//	{
	//		if (arr[i] == num) return i;
	//		// 不可以提前退出
	//	}
	//	return -1;


	/*
	数据量很大时是不是适合用哈希"
    对，而且理由就是你说的"快"。​


		+ ------------ + -------------- - +------------------ +
		| 数据量 | 推荐方式 | 原因 |
		+------------ + -------------- - +------------------ +
		| 很少(几十) | 顺序查找 | 简单, 不用建表  |
		| 中等(几百) | 二分(需有序) | 折中        |
		| 很大(几万 + ) | 哈希 | 算一次就定位     |
		+------------ + -------------- - +------------------ 
	*/

	return 0;
}





