#include<stdio.h>
int main()

{
	//内存地址也被称为指针

	//一般指针变量也会被叫做指针
	//注意:需要分清

	// 指针变量定义格式
//
//   数据类型   *   变量名
//      |        |     |
//      |        |     +-- 自己起的名字
//      |        +-------- 标记
//      +----------------- 要跟指向变量的类型保持一致
//
//
//   int a = 10;
//   int* p1 = &a;
//
//   double b = 10;
//   double* p2 = &b;

	//指针的作用:
//查询数据，存储数据，参数传递，内存管理。

	//利用指针去获取变量中的数据或存储数据

	int a = 10;

	//1.定义一个指针去指向变量a
	int* p1 = &a;

	//此时的 * 只是一个标记
	//表示当前是一个指针并记录内存地址

	//2.利用指针去获取变量中的数据
	printf("%d\n",*p1);

	// 打印这一块的星号是解引用运算符表示
	// 通过后面的内存地址去获取对应的数据

	//3.利用指针去存储数据
	*p1 = 200;
	printf("%d\n", *p1);
	printf("%d\n", a);

	//查询数据:  格式: *指针名

	*p1= 20;
	printf("%d\n", *p1);

	//此时为修改数据


	//1.存储数据:  格式: *指针名=数据值;

	//2.指针变量的数据类型要跟指针变量的类型保持一致

	//3.指针变量占用的大小与数据类型无关，跟编译器有关。

	//32位:4个字节，64位:8个字节


	//查询数据:*指针名

	//  * :解引用运算符

	char c = 'a';
	char* p2 = &c;

	long long n = 100;
	long long *p3 = &n;

	printf("%zu\n",sizeof(p2));    //亦可以写成p2
	printf("%zu\n", sizeof(p3));   //亦可以写成p3





}
