#include<stdio.h>
int main()
{
	//指针的类型:

	//数据类型 * 变量名 = 内存地址

	//int * p =0x001

	//指针中数据类型的作用:
	//获取字节数据的个数


	//要跟指向变量的类型保持一致
	// *:标记
	//自己起的名字


	//指针的运算

	//例子:

	//int a = 10;
	//int* p = &a; //0x01
	//p + 1

	//步长:指针移动一次的字节个数
    //是从原本的 0x01 ,跑到0x05

	//好比指针往前走了一步,这一步有数据类型决定


	/*
	指针运算:
		步长:指针移动一次,走了多少个字节。
		char:1
		short : 2
		int : 4 
		long : 4 
		long long : 8
		加法指针往后移动了 n 步 p + 1
		减法指针往后移动了 n 步 p - 1
	*/


	//定义变量
	int a = 10;
	int* p = &a;
	printf("%p\n",p);
	printf("%d\n", *p);    
	printf("%d\n", p);     
	printf("%p\n", p-1);
	printf("%p\n", p-2);
	printf("%p\n", p+1);
	printf("%p\n", p+2);

	//int* p = &a;    // 这里的 * 是"声明标记"——说明 p 是个装地址的变量
	//*p = 99;        // 这里的 * 是"解引用"——顺着地址找到那一格


	// 指针的运算

// 【有意义的操作】

//   指针跟整数进行加、减操作(每次移动 N 个步长)
//   指针跟指针进行减操作(间隔步长)


// 【无意义的操作】

//   指针跟整数进行乘除操作
//   原因:此时指针指向不明
//   指针跟指针进行加、乘、除操作



	return 0;
}