#include<stdio.h>
int main()
{

	//二维数组定义格式:

    //格式一:  
    
    // m:二维数组的长度:二维数组里面有多少个一维数组
    // n:一维数组的长度

      //数据类型:arr[m][n] =
      //{
        //{1,2,3,4...},
        //{1,2,3,4...},
        //{1,2,3,4...}
      //};

    //遍历:利用索引进行遍历/利用指针进行遍历
   
    //1.定义一个二维数组:
    /*int arr[3][5] =
    {
        {1,2,3,4,5},
        {11,22,33,44,55},
        {111,222,333,444,555}
    };*/

    //2.利用索引的方式进行遍历
    //arr[0]:表示二维数组当中的第一个一维数组 {1,2,3,4,5}
    //arr[1]:表示二维数组当中的第二个一维数组 {11,22,33,44,55}
    //arr[2]:表示二维数组当中的第三个一维数组 {111,222,333,444,555}
   


   //for(int i=0;i<3;i++)
   // {
   //     //i:依次表示二维数组中的索引
   //     for (int j = 0;j < 5;j++)
   //     {
   //         //j:依次表示一维数组中的索引
   //         //内循环:遍历每一个一维数组
   //         printf("%d\t",arr[i][j]);
   //     }
   //     //当内循环结束之后,表示一维数组遍历完成
   //     printf("\n");
   // }

   //弊端:数组必须是一样长的,不然无法定义


   // //格式二:
   // int arr1[5] = { 1,2,3,4,5 };
   // int arr2[5] = { 6,7,8,9,10 };
   // int* arr3[2] = { arr1,arr2 };

   /*
   二维数组的定义格式二 + 索引遍历
        核心:实现先把所有的一维数组定义完毕，再放到二维数组当中
   */


    //1.定义三个一维数组:
    int arr1[3] = { 1,2,3 };
    int arr2[5] = { 1,2,3,4,5 };
    int arr3[9] = { 1,2,3,4,5,6,7,8,99 };

    //预先计算每一个数组的真实长度
    int len1 = sizeof(arr1) / sizeof(int);
    int len2 = sizeof(arr2) / sizeof(int);
    int len3 = sizeof(arr3) / sizeof(int);

    //再定义一个数组,装所有数组的长度
    int lenarr[3] = { len1,len2,len3 };


    //2.把三个一维数组放入到二维数组当中
    //数组的数据类型,跟内部存储的元素类型保持一致
    //arr1 使用数组名计算的时候，退化为指向第一个元素的指针，此时不再表示数组中的那个整体
    //指针 ---内存地址     64位win  8个字节

    int* arr[3] = { arr1,arr2,arr3 };
    //注意:存的是内存地址,要用int*


    for (int i = 0;i < 3;i++)
    {

        //i:依次表示二维数组的索引 0 1 2 
        int len = sizeof(arr[i]) / sizeof(int);  //2  (行不通)
        for (int j = 0;j < lenarr[i];j++)
        {
            printf("%d  \t", arr[i][j]);
        }
        printf("\n");

    }












	return 0;
}



