#include<stdio.h>
int main()
{
	//利用指针遍历二维数组

	//数据类型 arr[2][5]=
	/*{
	
		{1,2,3,4,5},
		{11,22,33,44,55}
	}*/

    // 数组内部元素的类型
	// 数据类型 * 指针名 =arr
	//  int[5] *   p  
	//习惯写为 int (* p)[5]
	// 此时获取的是一维数组的指针
	//默认指向第一个元素的首地址
	//步长为int类型的4个字节,乘以5,得到的20
	//形如:p+1,跳过了第一个一维数组,到了第二个一维数组


	//1.定义一个二维数组
	int arr[3][5] =
	{

	{1,2,3,4,5},
	{ 11, 22, 33, 44, 55 },
	{ 111, 222, 333, 444, 555 }
	//这里面的 } 后面要用逗号,不是分号
	};

	//2.利用指针遍历二维数组
	//获取二维数组的指针

	//数组指针的数据类型:要跟数组内部元素类型保持一致
	//二维数组里面存储的是一维数组int[5]

	int(*p)[5] = arr;

	printf("%p\n",arr);
	printf("%p\n", arr+1);

	//68C 减 678 等于 14,转换成十进制，就是 20
	//程序运行时，操作系统临时分配的内存地址

	/*
	Windows 有一个叫 ASLR（地址空间布局随机化）的安全机制 —— 故意让每次的地址不一样，防止黑客预测内存在哪。
		所以：
		变的 → 首地址（arr 打印出来的那个数）
		不变的 → 两个地址之间的差（ + 20)
	*/
	 
	//int* p = arr;         // 初始化：p 拿到首地址    -> 不加 *
	//p < arr + 5;         // 比较地址：p 到哪了      -> 不加 *
	//p++;                // 移动地址：走下一格      -> 不加 *
	//printf("%d", *p);  // 取值打印                -> 要加 *

	/*一个循环体里，只有 printf 那一处加 * */


	//不是"printf 后面加"，是「你要的是值的时候加」。

	for (int i = 0;i < 3;i++)
	{
		//遍历一维数组
		for (int j = 0;j < 5;j++)
		{
			printf("%d\t",*(*p+j));
		}
		//换行
		printf("\n");
		//移动二维数组中的指针,继续遍历下一个数组
		p++;
	}

	//注意:二维数组的格式怎么写?
	//p++不要忘记

	return 0;
}