#include<stdio.h>
int main()
{
	//二维数组(指针操作)
	//第二种格式像是存放的指针的数组

	//数据类型 * 指针名 = arr

	//二维数组
	    //利用指针遍历二维数组

	//1.定义三个一维数组
	int arr1[5] = {1,2,3,4,5,};
	int arr2[5] = { 4,5,6,7,8, };
	int arr3[5] = { 1,23,54,76,34 };

	//2.把三个一维数组的内存地址,再放到内存地址当中
	int* arr[] = { arr1,arr2,arr3 };

	//3.获取指针
	int** p = arr;

	// int*:获取的是地址
	// *:特殊含义

	//遍历指针
	for (int i = 0;i < 3;i++)
	{

		for (int j = 0;j < 5;j++)
		{
			printf("%d  \t",*(*p+j));

		}
		printf("\n");
		//移动指针
		p++;
	}






	return 0;
}


