#include<stdio.h>
int main()
{
	// 数组指针和指针数组:
	
	// 数组指针:指向数组的指针
	// 作用:方便操作数组中的各种数据。

    //指针数组:存放指针的数组
    //作用用来存放指针


	//一、数组指针：指向数组的指针

	//	作用：方便地操作数组中的各种数据
	//	举例：int* p = arr;　　　　　　　步长为：int（4 字节）
	//	举例：int(*p)[5] = &arr;　　　 步长为：int × 5（20 字节）
	//	二、指针数组：存放指针的数组

	//	作用：用来存放指针
	//	举例：int * p[5];　这个数组里面存着 int 类型的指针
	//	右下角代码：

	

	int arr1[5] = { 1,2,3,4,5 };
	int arr2[5] = { 6,7,8,9,0 };
	int* arr[2] = { arr1, arr2 };      // 注意：这里写的是 arr[2]，不是 arr3
	//⚠️ 注意图上有个小问题： 上面说"指针数组"举例是 int* p[5]（装 5 个），下面代码却是 int* arr[2]（装 2 个）
	// ​两个不冲突，但名字一个 p 一个 arr，容易看混。









	return 0;
}

